/* 0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001111111111111111111 */
/* 0000001111111111222222222233333333334444444444555555555566666666667777777777888888888899999999990000000000111111111 */
/* 4567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678 */
PGM
DCL VAR(&RTCD) TYPE(*INT)
CALLPRC PRC('Qp2EndPase') RTNVAL(&RTCD)
IF COND(&RTCD *NE 0) THEN( +
  SNDPGMMSG MSG('La chiamata Qp2EndPase ha dato errore.'))
ENDPGM
