/* 000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000111111111111111111 */
/* 000000111111111122222222223333333333444444444455555555556666666666777777777788888888889999999999000000000011111111 */
/* 456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567 */
PGM
DCL VAR(&RTCD) TYPE(*INT)
CALLPRC PRC('Qp2EndPase') RTNVAL(&RTCD)
IF COND(&RTCD *NE 0) THEN( +
  SNDPGMMSG MSG('La chiamata Qp2EndPase ha dato errore.'))
ENDPGM
