PGM
SNDPGMMSG('Testing...')
CRTLIB LIB(&TGTLIB)
MONMSG(CPF0000)
CRTSRCPF FILE(&TGTLIB/QCLSRC) RCDLEN(132) 
MONMSG(CPF0000)
CPYSRCF FROMFILE(QTEMP/ILE_CL) TOFILE(&TGTLIB/QCLSRC) FROMMBR(STRPASENV) TOMBR(STRPASENV)
CPYSRCF FROMFILE(QTEMP/ILE_CL) TOFILE(&TGTLIB/QCLSRC) FROMMBR(ENDPASENV) TOMBR(ENDPASENV)
CPYSRCF FROMFILE(QTEMP/ILE_CL) TOFILE(&TGTLIB/QCLSRC) FROMMBR(GETPASENV) TOMBR(GETPASENV)
ENDPGM
